app/controllers/contatos_controller.rb

SELECT "contatos".* FROM "contatos"
---
  def index
    @contatos = Contato.all

INSERT INTO "contatos" ("nome", "telefone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Karoline Nanini"], ["telefone", "11974953844"], ["created_at", "2021-10-01 15:50:18.954553"], ["updated_at", "2021-10-01 15:50:18.954553"]]
---
  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save

DELETE FROM "contatos" WHERE "contatos"."id" = ?  [["id", 2]]
---
  def destroy
    @contato.destroy

SELECT "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_contato
      @contato = Contato.find(params[:id])